In [1]:
import pandas as pd, numpy as np, matplotlib.pyplot as plt, seaborn as sb

In [8]:
# 데이터 불러오기
df_2023 = pd.read_csv("hyundai/지역별수출실적_2023.CSV")
df_2024 = pd.read_csv("hyundai/지역별수출실적_2024.CSV")
df_2025 = pd.read_csv("hyundai/지역별수출실적_2025.CSV")

In [9]:
df_2023.head()

,Car,Region,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,Passenger Car,US,1048.0,633.0,627.0,245.0,0.0,0.0,2.0,0.0,0.0,4.0,0.0,5.0
1,Recreational Vehicle,US,33056.0,29697.0,31985.0,29103.0,28763.0,26013.0,27234.0,22619.0,20969.0,24759.0,33951.0,30920.0
2,Commercial Vehicle,US,0.0,0.0,0.0,0.0,0.0,0.0,NaN,0.0,0.0,0.0,0.0,0.0
3,Special Vehicle,US,0.0,0.0,0.0,0.0,0.0,NaN,NaN,NaN,0.0,0.0,0.0,NaN
4,"CKD(Inc, Special Vehicle)",US,0.0,0.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
df_2023["연도"] = 2023

In [11]:
df_2023.head()

,Car,Region,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,연도
0,Passenger Car,US,1048.0,633.0,627.0,245.0,0.0,0.0,2.0,0.0,0.0,4.0,0.0,5.0,2023
1,Recreational Vehicle,US,33056.0,29697.0,31985.0,29103.0,28763.0,26013.0,27234.0,22619.0,20969.0,24759.0,33951.0,30920.0,2023
2,Commercial Vehicle,US,0.0,0.0,0.0,0.0,0.0,0.0,NaN,0.0,0.0,0.0,0.0,0.0,2023
3,Special Vehicle,US,0.0,0.0,0.0,0.0,0.0,NaN,NaN,NaN,0.0,0.0,0.0,NaN,2023
4,"CKD(Inc, Special Vehicle)",US,0.0,0.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2023

In [12]:
df_2024.head()

,Car,Region,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,Passenger Car,US,-,-,"3,342","6,359","8,136","7,818","8,203","7,420","6,946","5,154","1,140","6,458"
1,Recreational Vehicle,US,"34,743","28,607","30,867","35,909","28,968","27,885","26,926","25,099","21,101","24,986","13,917","17,383"
2,Commercial Vehicle,US,-,-,-,NaN,-,-,NaN,-,-,-,-,-
3,Special Vehicle,US,NaN,-,-,NaN,-,-,NaN,-,-,-,-,-
4,"CKD(excl, Special Vehicle)",US,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
df_2024["연도"] = 2024

In [18]:
df_2024.head()

,Car,Region,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,연도
0,Passenger Car,US,-,-,"3,342","6,359","8,136","7,818","8,203","7,420","6,946","5,154","1,140","6,458",2024
1,Recreational Vehicle,US,"34,743","28,607","30,867","35,909","28,968","27,885","26,926","25,099","21,101","24,986","13,917","17,383",2024
2,Commercial Vehicle,US,-,-,-,NaN,-,-,NaN,-,-,-,-,-,2024
3,Special Vehicle,US,NaN,-,-,NaN,-,-,NaN,-,-,-,-,-,2024
4,"CKD(excl, Special Vehicle)",US,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2024

In [19]:
df_2025.head()

                          Car Region      Jan
0               Passenger Car     US   4518.0
1        Recreational Vehicle     US  23997.0
2          Commercial Vehicle     US      NaN
3             Special Vehicle     US      NaN
4  CKD(excl, Special Vehicle)     US      NaN

In [20]:
df_2025["연도"] = 2025

In [21]:
df_2025.head()

                          Car Region      Jan    연도
0               Passenger Car     US   4518.0  2025
1        Recreational Vehicle     US  23997.0  2025
2          Commercial Vehicle     US      NaN  2025
3             Special Vehicle     US      NaN  2025
4  CKD(excl, Special Vehicle)     US      NaN  2025

In [22]:
df_2023.columns

Index(['Car', 'Region', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug',
       'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [23]:
df_2024.columns

Index(['Car', 'Region', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug',
       'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [24]:
df_2025.columns

Index(['Car', 'Region', 'Jan', '연도'], dtype='object')

In [25]:
df = pd.concat([df_2023, df_2024, df_2025], ignore_index=True)

In [26]:
df.head()

,Car,Region,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,연도
0,Passenger Car,US,1048.0,633.0,627.0,245.0,0.0,0.0,2.0,0.0,0.0,4.0,0.0,5.0,2023
1,Recreational Vehicle,US,33056.0,29697.0,31985.0,29103.0,28763.0,26013.0,27234.0,22619.0,20969.0,24759.0,33951.0,30920.0,2023
2,Commercial Vehicle,US,0.0,0.0,0.0,0.0,0.0,0.0,NaN,0.0,0.0,0.0,0.0,0.0,2023
3,Special Vehicle,US,0.0,0.0,0.0,0.0,0.0,NaN,NaN,NaN,0.0,0.0,0.0,NaN,2023
4,"CKD(Inc, Special Vehicle)",US,0.0,0.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2023

In [27]:
df.columns

Index(['Car', 'Region', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug',
       'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [28]:
df.isna().sum()

Car         0
Region      0
Jan        48
Feb        80
Mar        84
Apr        90
May        89
Jun        91
Jul       107
Aug        87
Sep        96
Oct        96
Nov        91
Dec        97
연도          0
dtype: int64

In [29]:
df.fillna(0, inplace=True)

In [30]:
df.isna().sum()

Car       0
Region    0
Jan       0
Feb       0
Mar       0
Apr       0
May       0
Jun       0
Jul       0
Aug       0
Sep       0
Oct       0
Nov       0
Dec       0
연도        0
dtype: int64

In [31]:
df.columns

Index(['Car', 'Region', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug',
       'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [32]:
# 기존 컬럼명과 변경할 컬럼명 매핑
column_mapping = {
    'Car': '차량 구분',
    'Region': '국가명',
    'Jan': '1월',
    'Feb': '2월',
    'Mar': '3월',
    'Apr': '4월',
    'May': '5월',
    'Jun': '6월',
    'Jul': '7월',
    'Aug': '8월',
    'Sep': '9월',
    'Oct': '10월',
    'Nov': '11월',
    'Dec': '12월'
}

# 컬럼명 변경
df.columns = [column_mapping.get(col, col) for col in df.columns]

# 변경된 컬럼명 확인
df.columns

Index(['차량 구분', '국가명', '1월', '2월', '3월', '4월', '5월', '6월', '7월', '8월', '9월',
       '10월', '11월', '12월', '연도'],
      dtype='object')

In [34]:
df.to_csv("hyundai/현대_지역별수출실적_전처리.CSV", index=False)

In [35]:
# 데이터 불러오기
df_2023 = pd.read_csv("hyundai/차종별판매실적_2023.CSV")
df_2024 = pd.read_csv("hyundai/차종별판매실적_2024.CSV")
df_2025 = pd.read_csv("hyundai/차종별판매실적_2025.CSV")

In [36]:
df_2023.head()

,Model,Vehicle Type,Trade,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,Morning,Ordinary Vehicle,Domestic,1813.0,2049.0,2127.0,2164.0,2502.0,2245.0,2033.0,2910.0,1892.0,2225.0,2111.0,1808.0
1,Ray,Ordinary Vehicle,Domestic,3585.0,4268.0,4155.0,4158.0,4576.0,4372.0,4285.0,4402.0,3464.0,4824.0,4587.0,4254.0
2,K3,Ordinary Vehicle,Domestic,950.0,1024.0,1197.0,670.0,975.0,1540.0,976.0,1123.0,1036.0,939.0,1428.0,1346.0
3,K5,Ordinary Vehicle,Domestic,2560.0,2653.0,3421.0,2739.0,3166.0,2963.0,2246.0,2613.0,2280.0,2592.0,3783.0,3563.0
4,Stinger,Ordinary Vehicle,Domestic,113.0,120.0,143.0,61.0,45.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0

In [37]:
df_2023["연도"] = 2023

In [38]:
df_2023.head()

,Model,Vehicle Type,Trade,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,연도
0,Morning,Ordinary Vehicle,Domestic,1813.0,2049.0,2127.0,2164.0,2502.0,2245.0,2033.0,2910.0,1892.0,2225.0,2111.0,1808.0,2023
1,Ray,Ordinary Vehicle,Domestic,3585.0,4268.0,4155.0,4158.0,4576.0,4372.0,4285.0,4402.0,3464.0,4824.0,4587.0,4254.0,2023
2,K3,Ordinary Vehicle,Domestic,950.0,1024.0,1197.0,670.0,975.0,1540.0,976.0,1123.0,1036.0,939.0,1428.0,1346.0,2023
3,K5,Ordinary Vehicle,Domestic,2560.0,2653.0,3421.0,2739.0,3166.0,2963.0,2246.0,2613.0,2280.0,2592.0,3783.0,3563.0,2023
4,Stinger,Ordinary Vehicle,Domestic,113.0,120.0,143.0,61.0,45.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,2023

In [39]:
df_2024.head()

,Model,Vehicle Type,Trade,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,Morning,Ordinary Vehicle,Domestic,"1,214","1,140","1,416","1,421",907,985,"1,335",910,968,"1,464","1,467","2,608"
1,Ray,Ordinary Vehicle,Domestic,"4,130","3,972","4,692","4,460","4,456","3,574","4,384","3,710","3,363","3,278","4,753","4,219"
2,K3,Ordinary Vehicle,Domestic,"1,419","1,315","1,460","1,336",995,"1,341","1,373",588,4,NaN,NaN,NaN
3,K5,Ordinary Vehicle,Domestic,"3,336","2,970","3,577","3,168","2,405","2,932","2,702","2,690","2,277","3,030","2,645","2,105"
4,EV4,Ordinary Vehicle,Domestic,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0

In [40]:
df_2024["연도"] = 2024

In [41]:
df_2024.head()

,Model,Vehicle Type,Trade,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,연도
0,Morning,Ordinary Vehicle,Domestic,"1,214","1,140","1,416","1,421",907,985,"1,335",910,968,"1,464","1,467","2,608",2024
1,Ray,Ordinary Vehicle,Domestic,"4,130","3,972","4,692","4,460","4,456","3,574","4,384","3,710","3,363","3,278","4,753","4,219",2024
2,K3,Ordinary Vehicle,Domestic,"1,419","1,315","1,460","1,336",995,"1,341","1,373",588,4,NaN,NaN,NaN,2024
3,K5,Ordinary Vehicle,Domestic,"3,336","2,970","3,577","3,168","2,405","2,932","2,702","2,690","2,277","3,030","2,645","2,105",2024
4,EV4,Ordinary Vehicle,Domestic,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0,2024

In [42]:
df_2025.head()

      Model      Vehicle Type     Trade   Jan
0   Morning  Ordinary Vehicle  Domestic  1484
1       Ray  Ordinary Vehicle  Domestic  3876
2        K3  Ordinary Vehicle  Domestic     0
3       EV4  Ordinary Vehicle  Domestic     0
4        K5  Ordinary Vehicle  Domestic  2583

In [43]:
df_2025["연도"] = 2025

In [44]:
df_2025.head()

      Model      Vehicle Type     Trade   Jan    연도
0   Morning  Ordinary Vehicle  Domestic  1484  2025
1       Ray  Ordinary Vehicle  Domestic  3876  2025
2        K3  Ordinary Vehicle  Domestic     0  2025
3       EV4  Ordinary Vehicle  Domestic     0  2025
4        K5  Ordinary Vehicle  Domestic  2583  2025

In [45]:
df_2023.columns

Index(['Model', 'Vehicle Type', 'Trade', 'Jan', 'Feb', 'Mar', 'Apr', 'May',
       'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [46]:
df_2024.columns

Index(['Model', 'Vehicle Type', 'Trade', 'Jan', 'Feb', 'Mar', 'Apr', 'May',
       'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [47]:
df_2025.columns

Index(['Model', 'Vehicle Type', 'Trade', 'Jan', '연도'], dtype='object')

In [48]:
df = pd.concat([df_2023, df_2024, df_2025], ignore_index=True)

In [49]:
df.isna().sum()

Model            0
Vehicle Type     0
Trade            0
Jan             13
Feb             65
Mar             65
Apr             66
May             67
Jun             64
Jul             68
Aug             68
Sep             69
Oct             68
Nov             69
Dec             66
연도               0
dtype: int64

In [50]:
df.fillna(0, inplace=True)

In [51]:
df.isna().sum()

Model           0
Vehicle Type    0
Trade           0
Jan             0
Feb             0
Mar             0
Apr             0
May             0
Jun             0
Jul             0
Aug             0
Sep             0
Oct             0
Nov             0
Dec             0
연도              0
dtype: int64

In [52]:
df.columns

Index(['Model', 'Vehicle Type', 'Trade', 'Jan', 'Feb', 'Mar', 'Apr', 'May',
       'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [53]:
df['Vehicle Type'].unique()

array(['Ordinary Vehicle', 'Special Vehicle'], dtype=object)

In [54]:
df['Trade'].unique()

array(['Domestic', 'Export', 'Export(excl CKD)'], dtype=object)

In [55]:
# 기존 컬럼명과 변경할 컬럼명 매핑
column_mapping = {
    'Model':'차종',
    'Vehicle Type': '차량 구분',
    'Trade': '거래 유형',
    'Jan': '1월',
    'Feb': '2월',
    'Mar': '3월',
    'Apr': '4월',
    'May': '5월',
    'Jun': '6월',
    'Jul': '7월',
    'Aug': '8월',
    'Sep': '9월',
    'Oct': '10월',
    'Nov': '11월',
    'Dec': '12월'
}

# 컬럼명 변경
df.columns = [column_mapping.get(col, col) for col in df.columns]

# 변경된 컬럼명 확인
df.columns

Index(['차종', '차량 구분', '거래 유형', '1월', '2월', '3월', '4월', '5월', '6월', '7월', '8월',
       '9월', '10월', '11월', '12월', '연도'],
      dtype='object')

In [65]:
# 기존 값과 변경할 값 매핑
car_mapping = {
    'Ordinary Vehicle': '일반 차량',
    'Special Vehicle': '특수 차량',

}

# 'Car' 컬럼 데이터 변경
df['차량 구분'] = df['차량 구분'].replace(car_mapping)

# 변경된 데이터 확인
df['차량 구분'].unique()

array(['일반 차량', '특수 차량'], dtype=object)

In [61]:
# 기존 값과 변경할 값 매핑
car_mapping = {
    'Domestic': '국내',
    'Export': '수출',
    'Export(excl CKD)': '수출(CKD 제외)'    

}

# 'Car' 컬럼 데이터 변경
df['거래 유형'] = df['거래 유형'].replace(car_mapping)

# 변경된 데이터 확인
df['거래 유형'].unique()

array(['국내', '수출', '수출(CKD 제외)'], dtype=object)

In [67]:
df.head()

,차종,차량 구분,거래 유형,1월,2월,3월,4월,5월,6월,7월,8월,9월,10월,11월,12월,연도
0,Morning,일반 차량,국내,1813.0,2049.0,2127.0,2164.0,2502.0,2245.0,2033.0,2910.0,1892.0,2225.0,2111.0,1808.0,2023
1,Ray,일반 차량,국내,3585.0,4268.0,4155.0,4158.0,4576.0,4372.0,4285.0,4402.0,3464.0,4824.0,4587.0,4254.0,2023
2,K3,일반 차량,국내,950.0,1024.0,1197.0,670.0,975.0,1540.0,976.0,1123.0,1036.0,939.0,1428.0,1346.0,2023
3,K5,일반 차량,국내,2560.0,2653.0,3421.0,2739.0,3166.0,2963.0,2246.0,2613.0,2280.0,2592.0,3783.0,3563.0,2023
4,Stinger,일반 차량,국내,113.0,120.0,143.0,61.0,45.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,2023

In [66]:
df.to_csv("hyundai/차종별판매실적_전처리.CSV", index=False)

In [84]:
# 데이터 불러오기
df_2023 = pd.read_csv("hyundai/해외공장판매실적_2023.CSV")
df_2024 = pd.read_csv("hyundai/해외공장판매실적_2024.CSV")
df_2025 = pd.read_csv("hyundai/해외공장판매실적_2025.CSV")

In [85]:
df_2023.head()

,Plant,Plant Code,Model,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,US Plant,KaGA,Optima / K5,5701,6150,6635,5652,6396.0,5050.0,4771.0,6853.0,6150.0,6550.0,5900.0,3445.0
1,US Plant,KaGA,Sportage,6400,7950,9129,7358,8424.0,6142.0,5900.0,8450.0,7350.0,8150.0,7600.0,6150.0
2,US Plant,KaGA,Sorento,6795,5330,5385,6184,7368.0,6416.0,5513.0,7491.0,6602.0,7097.0,6100.0,4825.0
3,US Plant,KaGA,Telluride,9704,10400,11851,10206,11212.0,8792.0,8216.0,12313.0,10698.0,11903.0,10300.0,7850.0
4,China Plant,DYK,Pegas,3320,3436,3504,3465,3710.0,3548.0,3572.0,5866.0,7042.0,4121.0,5645.0,4495.0

In [86]:
df_2023["연도"] = 2023

In [87]:
df_2023.head()

,Plant,Plant Code,Model,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,연도
0,US Plant,KaGA,Optima / K5,5701,6150,6635,5652,6396.0,5050.0,4771.0,6853.0,6150.0,6550.0,5900.0,3445.0,2023
1,US Plant,KaGA,Sportage,6400,7950,9129,7358,8424.0,6142.0,5900.0,8450.0,7350.0,8150.0,7600.0,6150.0,2023
2,US Plant,KaGA,Sorento,6795,5330,5385,6184,7368.0,6416.0,5513.0,7491.0,6602.0,7097.0,6100.0,4825.0,2023
3,US Plant,KaGA,Telluride,9704,10400,11851,10206,11212.0,8792.0,8216.0,12313.0,10698.0,11903.0,10300.0,7850.0,2023
4,China Plant,DYK,Pegas,3320,3436,3504,3465,3710.0,3548.0,3572.0,5866.0,7042.0,4121.0,5645.0,4495.0,2023

In [88]:
df_2024.head()

,Plant,Plant Code,Model,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,US Plant,KaGA,K5,"1,286",30,4,15,2,0,0,0,NaN,NaN,NaN,NaN
1,US Plant,KaGA,Sportage,"8,100","9,920","9,546","10,735","10,048","9,300","8,800","11,520","10,350","11,150","9,000","6,720"
2,US Plant,KaGA,Sorento,"6,442","9,849","10,049","10,150","10,449","8,650","8,249","9,380","9,237","10,520","7,972","4,718"
3,US Plant,KaGA,Telluride,"9,172","10,901","10,401","11,500","11,401","10,050","9,851","12,190","11,302","12,300","10,118","8,192"
4,US Plant,KaGA,EV9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,10,11,130,"1,210","1,170"

In [89]:
df_2024["연도"] = 2024

In [90]:
df_2024.head()

,Plant,Plant Code,Model,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,연도
0,US Plant,KaGA,K5,"1,286",30,4,15,2,0,0,0,NaN,NaN,NaN,NaN,2024
1,US Plant,KaGA,Sportage,"8,100","9,920","9,546","10,735","10,048","9,300","8,800","11,520","10,350","11,150","9,000","6,720",2024
2,US Plant,KaGA,Sorento,"6,442","9,849","10,049","10,150","10,449","8,650","8,249","9,380","9,237","10,520","7,972","4,718",2024
3,US Plant,KaGA,Telluride,"9,172","10,901","10,401","11,500","11,401","10,050","9,851","12,190","11,302","12,300","10,118","8,192",2024
4,US Plant,KaGA,EV9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,10,11,130,"1,210","1,170",2024

In [91]:
df_2025.head()

,model,path,month,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,K5,US Plant,Jan,NaN,0,0,0,0,0,0,0,0,0,0,0
1,Sportage,US Plant,Jan,"9,247",0,0,0,0,0,0,0,0,0,0,0
2,Sorento,US Plant,Jan,"8,300",0,0,0,0,0,0,0,0,0,0,0
3,Telluride,US Plant,Jan,"10,350",0,0,0,0,0,0,0,0,0,0,0
4,EV6,US Plant,Jan,103,0,0,0,0,0,0,0,0,0,0,0

In [92]:
df_2025["연도"] = 2025

In [93]:
df_2025.head()

,model,path,month,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,연도
0,K5,US Plant,Jan,NaN,0,0,0,0,0,0,0,0,0,0,0,2025
1,Sportage,US Plant,Jan,"9,247",0,0,0,0,0,0,0,0,0,0,0,2025
2,Sorento,US Plant,Jan,"8,300",0,0,0,0,0,0,0,0,0,0,0,2025
3,Telluride,US Plant,Jan,"10,350",0,0,0,0,0,0,0,0,0,0,0,2025
4,EV6,US Plant,Jan,103,0,0,0,0,0,0,0,0,0,0,0,2025

In [94]:
df_2025['Feb'].unique()

array([0])

In [95]:
# 기존 값과 변경할 값 매핑
car_mapping = {

    'model':'Model',
    'path': 'Plant',

}

# 'Car' 컬럼 데이터 변경
df_2025['Model'] = df_2025['model'].replace(car_mapping)
df_2025['Plant'] = df_2025['path'].replace(car_mapping)


# 변경된 데이터 확인
df_2025['Model'].unique()
df_2025['Plant'].unique()

array(['US Plant', 'China Plants', 'Slovakia Plant', 'Mexico Plant',
       'India Plant'], dtype=object)

In [96]:
# 원하는 컬럼 순서 지정
new_column_order = ['Model','Plant','Jan', '연도']

# df_2025에서 실제 존재하는 컬럼만 필터링
existing_columns = [col for col in new_column_order if col in df_2025.columns]

# 컬럼 순서 변경
df_2025 = df_2025[existing_columns]

# 변경된 컬럼 확인
print(df_2025.columns)

Index(['Model', 'Plant', 'Jan', '연도'], dtype='object')

In [102]:
df = pd.concat([df_2023, df_2024, df_2025], ignore_index=True)

In [103]:
df.columns

Index(['Plant', 'Plant Code', 'Model', 'Jan', 'Feb', 'Mar', 'Apr', 'May',
       'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [104]:
# 기존 컬럼명과 변경할 컬럼명 매핑
column_mapping = {
    'Plant':'공장명(국가)',
    'Plant Code': '공장 코드',
    'Model': '차종',
    'Jan': '1월',
    'Feb': '2월',
    'Mar': '3월',
    'Apr': '4월',
    'May': '5월',
    'Jun': '6월',
    'Jul': '7월',
    'Aug': '8월',
    'Sep': '9월',
    'Oct': '10월',
    'Nov': '11월',
    'Dec': '12월'
}

# 컬럼명 변경
df.columns = [column_mapping.get(col, col) for col in df.columns]

# 변경된 컬럼명 확인
df.columns

Index(['공장명(국가)', '공장 코드', '차종', '1월', '2월', '3월', '4월', '5월', '6월', '7월',
       '8월', '9월', '10월', '11월', '12월', '연도'],
      dtype='object')

In [120]:
df.isna().sum()

공장명(국가)     0
공장 코드      29
차종          0
1월          6
2월         33
3월         33
4월         33
5월         34
6월         33
7월         33
8월         32
9월         33
10월        32
11월        33
12월        33
연도          0
dtype: int64

In [121]:
df.fillna(0, inplace=True)

In [122]:
df.isna().sum()

공장명(국가)    0
공장 코드      0
차종         0
1월         0
2월         0
3월         0
4월         0
5월         0
6월         0
7월         0
8월         0
9월         0
10월        0
11월        0
12월        0
연도         0
dtype: int64

In [124]:
df.to_csv("hyundai/현대_해외공장판매실적_전처리.CSV", index=False)

In [94]:
import os

base_path = "/Users/mi-yeonlim/Documents/Github/mini-project-2/data/raw/현대"

file_list = {
    "df_2023": "현지판매실적_2023.CSV",
    "df_2024": "현지판매실적_2024.CSV",
    "df_2025": "현지판매실적_2025.CSV"
}


df = {}

for name, file in file_list.items():
    full_path = os.path.join(base_path, file)
    if os.path.exists(full_path):
        df[name] = pd.read_csv(full_path, encoding='utf-8-sig')
        print(f"{name} 불러오기 성공 ✅")
    else:
        print(f"{name} 파일 없음 ❌ → 경로 확인 필요: {full_path}")

df_2023 불러오기 성공 ✅
df_2024 불러오기 성공 ✅
df_2025 불러오기 성공 ✅

In [95]:
df_2023 = df["df_2023"]
df_2024 = df["df_2024"]
df_2025 = df["df_2025"]

In [96]:
# 확인
df_2023.head()

,Model,Plant,Month,U.S.A,Canada,Mexico,Europe,Eastern Europe,Latin America,Middle East,Africa,Asia Pacific,India,China
0,Morning / Picanto,Korean Plant,January,0.0,0.0,0.0,5518.0,174.0,1452.0,1110.0,1073.0,459.0,0.0,0.0
1,Pride / Rio,Korean Plant,January,0.0,0.0,0.0,3130.0,61.0,68.0,347.0,512.0,608.0,0.0,0.0
2,K3,Korean Plant,January,0.0,95.0,57.0,0.0,171.0,13.0,175.0,5.0,333.0,0.0,0.0
3,K5 / Optima,Korean Plant,January,0.0,0.0,0.0,0.0,774.0,0.0,1116.0,1.0,3.0,0.0,0.0
4,Stinger,Korean Plant,January,466.0,22.0,10.0,101.0,10.0,0.0,0.0,0.0,180.0,0.0,0.0

In [97]:
df_2023["연도"] = 2023

In [98]:
df_2023.head()

,Model,Plant,Month,U.S.A,Canada,Mexico,Europe,Eastern Europe,Latin America,Middle East,Africa,Asia Pacific,India,China,연도
0,Morning / Picanto,Korean Plant,January,0.0,0.0,0.0,5518.0,174.0,1452.0,1110.0,1073.0,459.0,0.0,0.0,2023
1,Pride / Rio,Korean Plant,January,0.0,0.0,0.0,3130.0,61.0,68.0,347.0,512.0,608.0,0.0,0.0,2023
2,K3,Korean Plant,January,0.0,95.0,57.0,0.0,171.0,13.0,175.0,5.0,333.0,0.0,0.0,2023
3,K5 / Optima,Korean Plant,January,0.0,0.0,0.0,0.0,774.0,0.0,1116.0,1.0,3.0,0.0,0.0,2023
4,Stinger,Korean Plant,January,466.0,22.0,10.0,101.0,10.0,0.0,0.0,0.0,180.0,0.0,0.0,2023

In [99]:
df_2024.head()

,Model,Plant,Month,Korea,U.S.A,Canada,Mexico,*Europe,Eastern Europe,Latin America,Middle East,Africa,Asia Pacific,India,China
0,Morning / Picanto,Korea Plants,January,1214.0,0.0,0.0,0.0,4726.0,68.0,1564.0,1274.0,748.0,315.0,0.0,0.0
1,Pride / Rio,Korea Plants,January,0.0,0.0,0.0,0.0,82.0,2.0,0.0,148.0,2.0,0.0,0.0,0.0
2,Ray,Korea Plants,January,4020.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,Ray EV,Korea Plants,January,110.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,K3,Korea Plants,January,1419.0,0.0,9.0,39.0,0.0,71.0,10.0,749.0,104.0,1030.0,0.0,0.0

In [100]:
df_2024["연도"] = 2024

In [101]:
df_2024.head()

,Model,Plant,Month,Korea,U.S.A,Canada,Mexico,*Europe,Eastern Europe,Latin America,Middle East,Africa,Asia Pacific,India,China,연도
0,Morning / Picanto,Korea Plants,January,1214.0,0.0,0.0,0.0,4726.0,68.0,1564.0,1274.0,748.0,315.0,0.0,0.0,2024
1,Pride / Rio,Korea Plants,January,0.0,0.0,0.0,0.0,82.0,2.0,0.0,148.0,2.0,0.0,0.0,0.0,2024
2,Ray,Korea Plants,January,4020.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,2024
3,Ray EV,Korea Plants,January,110.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,2024
4,K3,Korea Plants,January,1419.0,0.0,9.0,39.0,0.0,71.0,10.0,749.0,104.0,1030.0,0.0,0.0,2024

In [102]:
df_2025.head()

,model,Plant,Month,Korea,U.S.A,Canada,Mexico,Europe,Eastern Europe,Latin America,Middle East,Africa,Asia Pacific,India,China
0,Morning / Picanto,Korea Plants,Jan,"1,484",0,0,NaN,"6,380",82,"1,440","1,290",515.0,685,0,0
1,Pride / Rio,Korea Plants,Jan,0,0,0,NaN,0,0,0,0,0.0,1,0,0
2,Ray,Korea Plants,Jan,"3,803",0,0,NaN,0,0,0,NaN,NaN,0,0,0
3,Ray EV,Korea Plants,Jan,73,0,0,NaN,0,0,0,NaN,NaN,0,0,0
4,K3,Korea Plants,Jan,0,0,5,2,0,15,5,181,70.0,409,0,0

In [103]:
df_2025["연도"] = 2025

In [104]:
df_2025.head()

,model,Plant,Month,Korea,U.S.A,Canada,Mexico,Europe,Eastern Europe,Latin America,Middle East,Africa,Asia Pacific,India,China,연도
0,Morning / Picanto,Korea Plants,Jan,"1,484",0,0,NaN,"6,380",82,"1,440","1,290",515.0,685,0,0,2025
1,Pride / Rio,Korea Plants,Jan,0,0,0,NaN,0,0,0,0,0.0,1,0,0,2025
2,Ray,Korea Plants,Jan,"3,803",0,0,NaN,0,0,0,NaN,NaN,0,0,0,2025
3,Ray EV,Korea Plants,Jan,73,0,0,NaN,0,0,0,NaN,NaN,0,0,0,2025
4,K3,Korea Plants,Jan,0,0,5,2,0,15,5,181,70.0,409,0,0,2025

In [105]:
# 기존 값과 변경할 값 매핑
car_mapping = {

    'model':'Model',

}

# 'Car' 컬럼 데이터 변경
df_2025['Model'] = df_2025['model'].replace(car_mapping)


# 변경된 데이터 확인
df_2025['Model'].unique()

array(['Morning / Picanto', 'Pride / Rio', 'Ray', 'Ray EV', 'K3',
       'K5 / Optima', 'Stinger', 'K7,8 / Cadenza', 'K9', 'Stonic',
       'Seltos', 'Soul', 'Soul EV', 'Niro', 'Niro EV', 'Niro Plus',
       'Niro Plus EV', 'EV3', 'EV4', 'EV5', 'EV6', 'EV9', 'Sportage',
       'Sorento', 'Mohave / Borrego', 'Carnival / Sedona', 'Tasman',
       'Bongo / Frontier', 'Bongo EV', 'Bus', 'PV5', 'Optima / K5',
       'Telluride', 'EV2', "Cee'd", "Cee'd CUV", 'Pride / Rio (SC)',
       'Pride / Rio (FB)', 'Pegas', 'Forte', 'KX1', 'Sonet',
       'KX3 / Seltos', 'Zhipao', 'Carnival', 'Syros', 'Carens MPV',
       'Carens MPV EV', 'Carnival (CKD)', 'K4', 'K7, K8 / Cadenza',
       'Bongo', 'Millitary', 'Tasman (CKD)', 'Bongo (CKD)',
       'Millitary (CKD)', 'Bus (CKD)'], dtype=object)

In [106]:
df_2025 = df_2025.drop(columns=['model'])

In [107]:
df_2023.columns

Index(['Model', 'Plant', 'Month', 'U.S.A', 'Canada', 'Mexico', 'Europe',
       'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
       'Asia Pacific', 'India', 'China', '연도'],
      dtype='object')

In [108]:
df_2024.columns

Index(['Model', 'Plant', 'Month', 'Korea', 'U.S.A', 'Canada', 'Mexico',
       '*Europe', 'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
       'Asia Pacific', 'India', 'China', '연도'],
      dtype='object')

In [109]:
df_2025.columns

Index(['Plant', 'Month', 'Korea', 'U.S.A', 'Canada', 'Mexico', 'Europe',
       'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
       'Asia Pacific', 'India', 'China', '연도', 'Model'],
      dtype='object')

In [110]:
# 원하는 컬럼 순서 지정
new_column_order = ['Plant', 'Month', 'Korea', 'U.S.A', 'Canada', 'Mexico', 'Europe',
       'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
       'Asia Pacific', 'India', 'China', '연도']

# df_2025에서 실제 존재하는 컬럼만 필터링
existing_columns = [col for col in new_column_order if col in df_2025.columns]

# 컬럼 순서 변경
df_2025 = df_2025[existing_columns]

# 변경된 컬럼 확인
print(df_2025.columns)

Index(['Plant', 'Month', 'Korea', 'U.S.A', 'Canada', 'Mexico', 'Europe',
       'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
       'Asia Pacific', 'India', 'China', '연도'],
      dtype='object')

In [111]:
columns_order = ['Model', 'Plant', 'Month', 'Korea', 'U.S.A', 'Canada', 'Mexico',
                 'Europe', 'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
                 'Asia Pacific', 'India', 'China', '연도']

In [112]:
df_2024.columns = df_2024.columns.str.replace(r'\*', '', regex=True)

In [113]:
# 필요한 컬럼 리스트
columns_order = ['Model', 'Plant', 'Month', 'Korea', 'U.S.A', 'Canada', 'Mexico',
                 'Europe', 'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
                 'Asia Pacific', 'India', 'China', '연도']

# 'Korea' 컬럼이 없는 경우 0으로 채워서 추가
for df in [df_2023, df_2024, df_2025]:
    for col in columns_order:
        if col not in df.columns:
            df[col] = 0

In [114]:
df_2023 = df_2023[columns_order]
df_2024 = df_2024[columns_order]
df_2025 = df_2025[columns_order]

In [115]:
df = pd.concat([df_2023, df_2024, df_2025], ignore_index=True)

In [116]:
df.columns

Index(['Model', 'Plant', 'Month', 'Korea', 'U.S.A', 'Canada', 'Mexico',
       'Europe', 'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
       'Asia Pacific', 'India', 'China', '연도'],
      dtype='object')

In [117]:
df.isna().sum()

Model               0
Plant               0
Month               0
Korea               9
U.S.A              65
Canada            120
Mexico            388
Europe             47
Eastern Europe     49
Latin America      50
Middle East        89
Africa             89
Asia Pacific       65
India              25
China              25
연도                  0
dtype: int64

In [118]:
df.fillna(0, inplace=True)

In [119]:
df.isna().sum()

Model             0
Plant             0
Month             0
Korea             0
U.S.A             0
Canada            0
Mexico            0
Europe            0
Eastern Europe    0
Latin America     0
Middle East       0
Africa            0
Asia Pacific      0
India             0
China             0
연도                0
dtype: int64

In [120]:
df.columns

Index(['Model', 'Plant', 'Month', 'Korea', 'U.S.A', 'Canada', 'Mexico',
       'Europe', 'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
       'Asia Pacific', 'India', 'China', '연도'],
      dtype='object')

In [122]:
# 기존 컬럼명과 변경할 컬럼명 매핑
column_mapping = {
    'Model': '차종',
    'Plant':'공장명(국가)',
    'Month': '월'
}

# 컬럼명 변경
df.columns = [column_mapping.get(col, col) for col in df.columns]

# 변경된 컬럼명 확인
df.columns

Index(['차종', '공장명(국가)', '월', 'Korea', 'U.S.A', 'Canada', 'Mexico', 'Europe',
       'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
       'Asia Pacific', 'India', 'China', '연도'],
      dtype='object')

In [123]:
df['월'].unique()

array(['January', 'Febuary', 'March', 'April', 'May', 'June', 'July',
       'August', 'September', 'October', 'November', 'December', 'Jan'],
      dtype=object)

In [124]:
# 영어 월 → 한글 '1월', '2월' 형태로 변환
month_eng_to_kor = {
    'January': '1월', 'Jan': '1월',
    'February': '2월', 'Febuary': '2월',  # 오타도 처리
    'March': '3월',
    'April': '4월',
    'May': '5월',
    'June': '6월',
    'July': '7월',
    'August': '8월',
    'September': '9월',
    'October': '10월',
    'November': '11월',
    'December': '12월'
}


df['월'] = df['월'].map(month_eng_to_kor)

In [125]:
df['월'].unique()

array(['1월', '2월', '3월', '4월', '5월', '6월', '7월', '8월', '9월', '10월', '11월',
       '12월'], dtype=object)

In [128]:
df.to_csv("/Users/mi-yeonlim/Documents/Github/mini-project-2/data/processed/현대_해외현지판매_전처리.CSV", index=False, encoding='utf-8-sig')

In [129]:
df.head()

,차종,공장명(국가),월,Korea,U.S.A,Canada,Mexico,Europe,Eastern Europe,Latin America,Middle East,Africa,Asia Pacific,India,China,연도
0,Morning / Picanto,Korean Plant,1월,0,0.0,0.0,0.0,5518.0,174.0,1452.0,1110.0,1073.0,459.0,0.0,0.0,2023
1,Pride / Rio,Korean Plant,1월,0,0.0,0.0,0.0,3130.0,61.0,68.0,347.0,512.0,608.0,0.0,0.0,2023
2,K3,Korean Plant,1월,0,0.0,95.0,57.0,0.0,171.0,13.0,175.0,5.0,333.0,0.0,0.0,2023
3,K5 / Optima,Korean Plant,1월,0,0.0,0.0,0.0,0.0,774.0,0.0,1116.0,1.0,3.0,0.0,0.0,2023
4,Stinger,Korean Plant,1월,0,466.0,22.0,10.0,101.0,10.0,0.0,0.0,0.0,180.0,0.0,0.0,2023